{"Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  A                              Tweet                                               Page1AtoAdvancementPage2AdventurertoAmmunitionPage3AmnesiatoArcticAmnesiatoArcticPage4ArenatoAxleView              All \"A\" Symbolson One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  A": "\nsee the letter \"A\" in your dream represents the beginning of a new\nstage. You are moving on to something new and grand. Alternatively, the letter\n\"A\" invokes feelings of superiority and grandeur. It may indicate the\nname or initial of a person.   \n", "Aardvark": "\nsee an aardvark in your dream indicates that you are being very secretive and\ncautious about your business.    \n", "Abacus": "\nsee or use an abacus in your dream refers to your outdated views. You  have\nan old fashion perspective on certain issues.  \n", "Abalone": "\nsee or eat abalone in your dream indicates a transitional period in your life.\nThe symbol may also be a play on words to indicate feelings of\n\"loneliness\".  \n", "Abandonment": "\ndream that you are abandoned suggests that it is time to leave behind past\nfeelings and characteristics that are hindering your growth. Let go of your old\nattitudes. A more direct and literal interpretation of this dream indicates you\nhave a fear of being deserted, abandoned, or even betrayed. It may stem from a \nrecent loss or a fear of losing a loved one. The fear of abandonment may\nmanifest itself into your dream as part of the healing process and dealing with\nlosing a loved one. It may also stem from unresolved feelings or problems from\nchildhood. Alternatively, the dream indicates that you are feeling neglected or\nthat your feelings are being overlooked. Perhaps the dream is a metaphor that\nyou need to approach life with \"reckless abandon\" and live more\nfreely. ", "Abbey": "\nsee an abbey in your dream signifies\nspirituality, peace of mind and freedom from anxiety. You are in a state of\ncontentment and satisfaction. Help for you is always around the corner. ", "Abbot": "\nsee an abbot in your dream suggests that someone has power over you and are\nmaking you do things that you do not necessarily want to do. You are feeling\nconfined or restricted. The dream indicates that you will experience many\nobstacles and setback before achieving success and prestige.    \n", "Abbreviation": "\nsee abbreviations in your dream may represent the initials of someone in your\nlife. The abbreviations could stand for an organization or a common acronym or\nit may spell out some hidden message or advice. The dreaming mind likes to make\nuse of puns, as well as shorthand messages. For example, \"CD\" could be\na pun on a \"seedy\" situation. \"AA\" could stand for\nAlcoholics Anonymous and thus point to the dangers or your excesses and negative\nbehaviors. \"Inc\" may represent an \"inkling\", hunch or\nsuspicious you have about a situation. The initails DM may refer to a\ndirect message or perhaps that you need to check Dream Moqds for your dream\nanaylsis.  \n \n", "Abdomen": "\nsee your abdomen in a dream refers to your natural instincts and repressed\nemotions. There is something in your real life that you \"cannot\nstomach\" or have difficulties accepting. You need to get it out of your\nsystem. Alternatively, the dream symbol may be strictly physiological and you\nmay just be experiencing constipation or indigestion. ", "Abduction": "\ndream of being abducted indicates that you are being manipulated by your\ncircumstances or by someone. You lack control of your own life.", "Abhorrence": "\ndream that you abhor a person represents your waking dislike for that person.\nYou are harboring feelings of resentment or aggression and feel that this person\nhas acted in a less than honorable way.", "Abnormal": "\ndream of some abnormality or of abnormal objects indicate that the problems that\nhave been preoccupying your mind will soon be resolved. Note\nthat anything appearing abnormal draws attention to that particular aspect.\nSomething in your life may not be consistent with how you feel things should be.  \n \n", "Abode*PleaseSee Home.AbominableSnowman*PleaseSee Yeti.Aborigine": "\nsee an Aborigine in your dream represents both your untamed, natural self and\nyour pure, innocent side. You need to be more in touch with your intuition and\ninner forces.  It also suggests that you are being overindulgent or overly\nemotional. You may be harming yourself and jeopardizing your well-being due to\nyour unrestraint.   \n", "Abortion": "\ndream that you have an abortion suggests that you are hindering and blocking\nyour own growth. You may be hesitant in pursuing a new direction in your life\ndue to fear, pressure, personal conflict or moral obligation. The dream may also\nbe a reflection of your own real-life abortion and thus serves as  a way\nof healing from the trauma and working towards self-acceptance. Alternatively,\nthis dream may also be a message for you to take care and look after your\nhealth.", "**SeeThe Meaning In Action: \"BoilingA Rabbit\"Above": "\nsee something above you in your dream suggests that you need to set your goals\nhigher. Aim high! Alternatively, the dream indicates that you are feeling\ninferior or inadequate.  \n", "AbrahamLincoln": "\nsee Abraham Lincoln in your dream refers to your solid character and leadership\nability. Known as \"Honest Abe\", the dream may also be telling you to\nbe truthful or to come clean about something.   \n", "Abroad": "\ndream of being or going abroad  indicates unbalance and chaos in your\ncurrent situation and condition. Consequently, your dream may represent your\nneed for a change in scenery or a desire to escape from a current situation. You\nneed to make some drastic changes in your life. Alternatively,  the\ndream may suggest that you need to expand your horizons or experience a new\nsense of spirituality.  \n", "Absence": "\ndream that someone is absent, especially if you expect to find them, suggests\nthat you are looking for something that is already lost to you. Alternatively,\nyou may be looking to fill a void in your life. Something is missing from your\nlife.  \n", "Abscess": "\ndream that you have an abscess suggests that there is something that you need to\nexpress and get out into the open.  \n", "*Pleasesee Sores.Abscond": "\ndream that you have absconded with something indicates your failed\naccomplishments. You may also be feeling insecure about your achievements. You\nfeel that you are never good enough. Consider the significance or value of what\nyou have absconded.  \n", "Absorb": "\nbe absorbed in whatever you are doing suggests that you may be too focused on\nyour own thing and risk alienating others around you. The dream may also be a\nmetaphor that you need to integrate and adapt to your various surroundings.  \n", "Abstinence": "\ndream that you practice abstinence from drinking, sex  or any other sort of\nsensual temptation is a warning against being over confidant.  You need to\ntake things more slowly.  \n", "Abundance": "\ndream of having an abundance of a certain item indicates that you need to\nconserve your resources and energies. This dream may be a compensatory\ndream for something that you are lacking in life. \nMore directly, abundance signifies happiness.  ", "Abuse": "\ndream you are abusing someone suggests that your past actions will come back to\nhaunt you. You may be expressing some regret or remorse over your actions.", "Abyss": "\ndream of an abyss signifies an obstacle that is creating much anxiety for you.\nYou need to work through the difficulty and overcome this obstacle in your life. \nPerhaps you are afraid of  \"taking the plunge\".", "Acacia": "\nsee an acacia tree in your dream symbolizes your attitudes with death and your\nsense of mortality.  \n", "Academy": "\ndream of an academy signifies new friendships and opportunities.  \n", "AcademyAwards": " dream\nthat you at the Academy Awards indicates that you need to add some glamour into\nyour life. If you win an Oscar, then it implies that you are looking for some\nsort of acknowledgment in your waking life.  \n", "Accelerator": "\nsee an accelerator in your dream indicates that you will achieve your goals\nthrough your own efforts. The dream may also be telling you to slow down.", "Accent": "\nspeak with an accent in your dream suggests that you are having difficulties\nconveying your thoughts. Consider how you feel about the accent. If you feel the\naccent makes you stand out in a negative way, then it signifies feelings of\ninsecurities. If the accent makes you stand out in a positive way, then it\nsymbolizes an air of confidence. ", "Acceptance": "\ndream about acceptance indicates issues of self-esteem and measuring up to the\nexpectations of others. There is a waking situation where you are seeking\nacceptance and wanting to be a part of.   \n", "Accessory": "\ndream of accessorizing yourself suggests that you are feeling incomplete.\nSomething is missing in your life.  \n", "Accident": "\ndream that you are in an accident signifies pent-up guilt in which you are\nsubconsciously punishing yourself over. Perhaps\nyou are not proud of something you have done. Alternatively, the accident\nmay symbolize an error or mistake you have made. Accident dreams also represent\nyour fears of being in an actual, physical accident. You may simply be nervous\nabout getting behind the wheel. Or the dream is trying to warn you of some\naccident.", "Accomplice": "\ndream that you are an accomplice to a crime suggests that someone in your waking\nlife is having a negative influence on you. You may be experiencing feelings of\nguilt with something that you have done.   \n", "Accordion": "\nhear the music of an accordion signifies some saddening and depressing matter.\nYou need to focus on more joyous moments.", "Accountant": "\nsee or dream that you are an accountant represents your objectivity toward some\nsituation. You are taking a step back and looking carefully at the facts.  \n", "Accounts": "\ndream about your bank accounts indicates financial worries.  \n", "Accuse": "\ndream that you are being accused of something indicates overwhelming feelings of\nguilt.  It may also mean that you are having some doubts about yourself and\nthe choices you are making.", "Ace": "\nsee the ace in a deck of cards suggests ambiguity in your life. You need some\nclarity. In particular, the ace of hearts means that you are involved in\nsome love affair. If you see the ace of spades in your dream, then it means that\nyou are involved in a scandal. If you see the ace of diamonds, then it\nsymbolizes your legacy or reputation. And if you see the ace of clubs, then it\nindicates that you will be involved in some legal matter.Alternatively,\nthe dream may be a metaphor that you are an \"ace\". Or the dream is a\npun on \"acing\" a test.   \n", "Aches": "\ndream that you have aches indicate some hesitation and reluctance in the pursuit\nof your goals. If you wait too long, then the opportunity may escape.  \n", "Achievement": "\ndream of an achievement denotes that you will be greatly satisfied with the\noutcome of a situation or project. The bigger the achievement, the greater the\nsatisfaction.   \n", "Acid": "\nsee acid in your dream represents feelings of hatred, rage, and/or revenge. Your\nintegrity may be compromised or called into question.  Alternatively,\nseeing acid in your dream indicates that you are being manipulated by a\nsituation or by someone. The dream may also be a metaphor to symbolize a\nnegative influence in your life. Something or someone is eating away at you. ", "AcnePleaseSee Pimples.Acorn": "\nsee an acorn in your dream symbolizes strength and durability. Seemingly small\nbeginnings will have the greatest potential for growth. Don't underestimate your\nminor goals. Alternatively, the dream means that you are about to enter a new\nphase in your life. ", "Acquaintance": "\nsee an acquaintance in your dream represents aspects of yourself that you are\nstill trying to get to know.", "Acquit": "\ndream that you are acquitted of a crime represents a valuable lesson to be\nlearned.", "Acrobat": "\nsee or do acrobats in your dream suggest that you need to better balance aspects\nof your life. It could also mean that fears will prevent you from achieving your\ngoals. Alternatively, acrobatics in your dream may be a metaphor for sexual\nintercourse.   \n", "Acting": "\ndream that you are acting indicates that you are putting up a front and\npretending to be someone you are not in some waking situation.  \n", "ActionFigure": "\nsee or dream that you are playing with an action figure suggests that you are\nbeing manipulated in some way. Or you tend to do what other people expect of\nyou. Also consider the significance of the way that the action figure is\ndressed. \n", "Actor/Actress": " see\nan actor or actress in your dream represents your pursuit for pleasure. Your\nadmiration of a particular celebrity may lead to a desire to have some of their\nphysical or personality traits. Consider also who this actor/actress is and what\ncharacteristics you associate with her or him. These may be the same\ncharacteristics that you need to acknowledge or incorporate into yourself. The\ndream may also be a pun on her or his name. ", "Acupuncture": "\ndream that you are getting acupuncture suggests that you are in need of healing.\nYou may need to divert your energies to different pursuits. Alternatively, the\ndream may be a metaphor for a problem or issue that you need to pinpoint.   \n", "AdamAnd Eve": "\nsee Adam and Eve in your dream,  suggests that you are ignoring the\nmasculine aspect of yourself (if you are female) or the feminine aspect of\nyourself (if you are male). Adam and Eve are classic symbols of the animus and\nanima. Alternatively, the dream indicates an occurrence in your life that will\ncause you to lose your hopes and chances of success.   \n", "Adamant": "\ndream that you are adamant signifies that you will be thwarted in some desire\nthat you held ever so highly in your life.   \n", "Adder": "\nsee an adder in your dream symbolizes a sly or cunning person. This person\ncannot be trusted.  It may also represent something or someone who has\nslipped out of your hands. The dream may also be a pun on something that you\nneed to add to your life.  \n", "Addict": "\ndream that you are an addict indicates that you are no longer in control of a\nsituation. You have surrendered your power and denied responsibility for your\nactions. The dream is also representative of fear, low self-esteem issues, and\ninsecurities.   \n", "Addiction": "\ndream that you have an addiction or become addicted represents an obsessive\nbehavior.  A situation or a person may be trying to take over your sense of\ncontrol. The dream also suggests that you have difficulty relating to the world\naround you.    \n", "Addition": "\ndream that you are solving an addition problem represents something that is\nstraightforward or obvious. Do not read too much into a problem. ", "Address": "\ndream of your old address suggests that you need to take a look back at the past\nand learn from it. ", "Adieu*PleaseSee Goodbye.Admiral": "\nsee or dream that you are an admiral represents your ability to tackle life's\nissues and problems with confidence and decisiveness. The admiral may also\nsymbolize a father figure or authoritative person.   \n", "Admire": "\ndream that you are admiring someone indicates that you need to incorporate the\nqualities of that person into your Self. ", "Adobe": "\nsee an adobe structure in your dream symbolizes protection. It also implies that\nyou are well insulated from life's problems. Perhaps you are being too sheltered\nand are lacking experience in certain areas of your life. Alternatively, an\nadobe building represents tradition, hard work and a simple way of life. Maybe\nyou need to incorporate these qualities into your waking life.   \n", "Adolescent*Pleasesee Teenager.Adopt": "\ndream that you or others are adopting a child indicates that you are taking on\nsomething new and different. Ask yourself what is missing in your life that\nwould make you happy.", "Adulation": "\ndream that you seek adulation signifies that you will arrogantly step up to\nundeserved position of honor.    ", "Adultery": "\ndream that you commit adultery or have an affair signifies your sexual urges and\ndesires that are longing to be expressed. Alternatively, it indicates\nself-betrayal of your subconscious. You may find yourself entangled in a\nsituation that is not in your best interest, perhaps even illegal. ", "***Goto CommonDreams: Cheating Dreams for further analysis. Advancement": "\ndream that you are advancing in some situation signifies your rapid rise to\nsuccess and honor.  Affairs of the heart will also be in your favor.", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  B                              Tweet                                               Page1BtoBarristerPage2BartendertoBestialityPage3BettoBoathouseBettoBoathousePage4BobbleHeadtoBreezePage5BrewtoBuzzardView              All \"B\" Symbols on One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  B": "\nsee the letter B in your dream is a pun on \"to be\". Perhaps the dream\nis telling you to \"let it be\".  \n", "Baboon": "\nsee a baboon in your dream suggests that you need to be more expressive in your\nfeelings. You need to be more direct in telling others how you feel. On the\nhand, it could be saying that you are expressing yourself in an inappropriate\nmanner. In\nparticular, dreaming of a white baboon means that you are completely devoid of\nemotions.  \n", "Baby": "\nsee a baby in your dream signifies innocence, warmth and new beginnings.\nBabies symbolize something in your own inner nature that is pure, vulnerable,\nhelpless and/or uncorrupted. If you dream that the baby is smiling at you, then\nit suggests that you are experiencing pure joy. You do not ask for much to make\nyou happy. If you find a baby in your dream, then it suggests\nthat you have acknowledged your hidden potential. If you dream that you forgot\nyou had a baby, then it suggests that you are trying hide your own\nvulnerabilities; you do not want to let others know of your weaknesses.\nAlternatively, forgetting about a baby represents an aspect of yourself that you\nhave abandoned or put aside due to life's changing circumstances. The dream may\nserve as a reminder that it is time for you to pick up that old interest, hobby,\nor project again. Dreaming of holding a baby is analogous to holding onto an\nearlier part of your life where you felt more depended on and more needed.If\nyou dream that you are on your way to the hospital to have a baby, then it\nsignifies your issues of dependency and your desires to be completely cared for.\nPerhaps you are trying to get out of some responsibility. If you are pregnant in\nreal life, then a more direct interpretation may simply mean that you are\nexperiencing some anxieties of making it to the hospital when the time comes. ", "***Readour special section on DreamingWhile Pregnant.  BabyBottle": "\nsee a baby bottle in your dream represents your issues of dependency. You are\nrelying too much on others. If you are drinking from a baby bottle, then the\ndream means that you need are emotionally immature. You need to grow up.  \n", "BabyCarriage": "\nsee a baby carriage in your dream symbolizes your desire for a family or longing\nfor a baby. If the baby carriage is empty, then it indicates sadness or an\nunfulfilled goal. Alternatively, it suggests that you need to cater to the needs\nof your own inner child.   \n", "BabyClothes": "\nsee baby clothes in your dream suggests that you are expressing yourself in a\nmore subtle way. Alternatively, baby clothes represent your former ways of\nthinking or old habits which you have outgrown.  \n", "BabyFood": "\nsee or feed baby food in your dream indicates that nurturance and care is needed\nin a waking situation. Alternatively, the dream may be a metaphor to indicate\nthat you need to eat smaller portions of food.    ", "BabyShower": "\ndream of a baby shower suggests that you are welcoming a new start. You are\ngiven a chance to start over again and do things differently this time around.\nYou have a new found faith in life itself.   \n", "Babysitter": "\ndream that you are babysitting suggests that you need to care for the child\nwithin yourself.", "Bachelor": "\nmeet a bachelor in your dream suggests that you are seeking freedom in your love\nlife.  For a man to dream that he is a bachelor indicates that he is having\ndifficulty with gaining his own sense of self or freedom in a relationship.\nAlternatively, the bachelor represents your masculine side.  \n", "Back-biting": "\ndream of back-biting about someone warns that you will cause harm to someone if\nyou continue on your current course. Think twice over your actions and its\nconsequences.", "Back": "\ndream of your back represents your attitudes, strengths, burdens and stance in\nthe world. It may also relate to stress and pressure that someone is putting on\nyou.", "Backbone*Pleasesee Spine.Backdoor": "\nsee a backdoor in your dream suggests that you need to search a little harder to\nfind an answer to your problem. Sometimes the solution may not be obvious. \nAlternatively, the dream indicates that you are trying to find short cuts to do\nthings.   \n", "Backflips": "\ndream that you are doing backflips suggests that you are going out of your way\nto help or please someone. You may feel under-appreciated or that your work is\ngoing unnoticed.  \n", "*Pleasesee also Cartwheels.Backgammon": "\nsee a backgammon game in your dream represents an unwelcome guest.", "Background*PleaseSee Landscape.Backpack": "\nsee or carry a backpack in your dream represents the decisions and\nresponsibilities  that are weighing your down.   \n", "Backpacking": "\ndream that you are backpacking symbolizes your self-sufficiency and survival\nskills. You may be reflecting on all the obstacles and adversities that you have\novercame.  \n", "Backseat": "\ndream that you are sitting in the backseat of a car suggests that you are no\nlonger in control of your life.  You may be feeling overpowered, dominated\nand being told what to do. You need to start taking back control of your life. ", "Backside*PleaseSee Buttocks.Backstab": "\ndream that you are backstabbing someone represents your ruthlessness. Your\ncharacter is being called into question.", "Backstage": "\ndream that you are backstage symbolizes opportunities and access. You need to\nmake sure to take advantage of this limited time opportunity. Alternatively, the\ndream indicates that there are aspects of yourself that you are reluctant to\nexpress or show.  Or it may also mean that you need to look at some\nsituation or problem from a new perspective.  \n", "Backstroke": "\ndream that you are doing the backstroke suggests that although\nyou are acknowledging your emotions,  you are not confronting them\nhead on.   \n", "Backward": "\ndream that you are walking or moving backwards indicates that your current\ncourse of action may be counter-productive. Whatever you are looking for in life\nseems to be moving away from you. Thus, you may feel a sense of failure or\nbelief that you are unable to achieve your goals and aspirations. On the other\nhand, moving backwards in your dream indicate that you need to back off or\nretreat from a situation that you are currently facing in your waking life.Dreaming\nthat you fall backwards suggests that you prevented yourself from making a bad\ndecision or mistake. It may also mean that you are not ready to move forward and\nneed to take a step back.   \n", " sdoommaerd is spelled backwards.Backyard": "\ndream about your backyard represents your childhood memories or your subconscious. Alternatively, dreaming of your backyard refers to the secrets you\nare keeping. There are some aspects of your life which you want to keep hidden\nand out of the view of others. The dream also represents some aspect of your\nlife that you have taken for granted. Consider also the phrase \"not in my\nbackyard.\" In other words, everything is okay as long as it does not happen\nto you or occur in your own home. The condition of the yard is also symbolic of\nhow well you maintain and balance aspects of your life.   \n", "Bacon": "\nsee bacon in your dream symbolizes essentials, staples, and life's supply. It\nmay also be a play on the common phase \"bringing home the bacon\" to\nrefer to earning a living.", "Bad": "\ndream that you are feeling bad suggests that you are off balance, off centered,\nor even feeling worthless.  \n", "BadBreath": "\ndream that you have bad breath suggests that you need to think twice before\nopening your mouth. Think about what you are saying first before expressing\nyourself and offending others.  \n", "Badge": "\nsee or flash a badge in your dream represents recognition of your position. You\nare held in high honor and prestige. You regard yourself highly. Alternatively,\nit signifies your need to belong and to be part of something.  \n", "Badger": "\nsee a badger in your dream signifies your persistence and final victory over\nyour opponents. The dream may also be a pun on how you are badgering others or\nvice versa. Perhaps someone, especially someone of power is bothering you and\ngiving you a difficult time.  \n", "Badminton": "\nplay or watch a badminton game in your dream indicates that you need to make a\ndecision quickly or else opportunities will pass you by.  You need to learn\nto keep up.  \n", "Bag": "\nsee a bag in your dream represents the responsibilities that you carry. If the\nbag is ripped or torn, then it indicates that you are carrying a lot of burden.\nThe symbol may be a metaphor for an \"old bag\" and refer to someone who\nis old.", "Bagel": "\nsee or eat a bagel in your dream  suggests that there is key element\nmissing from your life. You are not completely whole.  Alternatively, it\nrefers to sexual urges.   \n", "Baggage": "\nsee or carry baggage in your dream refers to the problems and things that you\nare carrying on your shoulders and weighing your down. You feel that you are\nbeing held back by past emotions or problems. Alternatively, baggage symbolizes\nyour identity.   \n", "BaggageClaim": "\ndream that you are at baggage claim suggests that you are experiencing a lack of\nidentity. You are not sure who you are or who you want to be.  \n", "BaggageScanner": "\nsee a baggage scanner or have your baggage scanned in your dream implies that\nyour identity is under scrutiny. You feel you are being judge. Alternatively,\nthe dream refers to a lack of privacy. You feel exposed.  \n", "Bagpipe": "\nsee or hear bagpipes in your dream signify strength and virility. You will\novercome your struggles.   \n", "Bail": "\ndream that you are making bail symbolizes your need to accept help in your\nbusiness dealings. This dream is trying to make you acknowledge that it is\nperfectly all right to accept a helping hand.   \n", "Bailiff": "\nsee a bailiff in your dream suggests that you have crossed a certain boundary\nand now must be held accountable for your actions.  ", "Bait": "\nsee bait in your dream suggests that you may be fishing for a deal or a\ncompliment. It may also indicate your desire to lure or entice someone.   \n", "Bake-house": "\nsee a bake-house in your dream signifies danger and pitfalls that you may be\nencountering in your waking life.   \n", "Bakery": "\nsee a bakery in your dream signifies richness and success. Your future will be\nan enjoyable, pleasant and filled with satisfaction.   \n", "Baking": "\ndream that you are baking represents your creative self and your ability to make\nthings happen. If you are mixing  ingredients together that you normally\nwould not combine, then it suggests that you need to find a connection between\ntwo seemingly different things. Perhaps these things that seem incompatible may\nyield surprisingly but positive results.    \n", "Balaclava": "\nsee or wear a balaclava in your dream refers to a sinister or painful secret you\nare keeping. This secret is creating a burden for you and becoming too hard to\nkeep. Alternatively, wearing a balaclava refers to your desire for anonymity in\na situation.", "Balance": "\ndream that you lose your balance suggests that you are having difficulty\nweighing your options and choices in some situation.   \n", "BalanceBeam": "\ndream that you are walking on a balance beam indicates that there is a situation\nthat requires your focus and full attention. Alternatively, the dream may \nbe a metaphor for the various aspects that you are trying to balance in your\nlife.    \n", "Balcony": "\nsee or dream that you are on a balcony refers to your desire to be seen and\nnoticed.  You are searching for prestige and higher status. It may also\nmean that you are on your way up the social ladder. If the balcony is clean,\nthen it indicates that you are looked up to by others. If the balcony is old,\nthen it suggests that your public image is in need of repair. Alternatively,\nthe balcony could signify your ambivalence regarding a situation. You are\nfeeling torn or undecided.    \n", "Bald": "\ndream that you are going bald suggests a lack of self-esteem or worries about\ngetting older. Alternatively, baldness symbolizes humility, purity, and personal\nsacrifice. You are at a stage in your life where you are confident in fully\nexposing yourself.   \n", "*Pleasesee also Hair.Ball": "\nsee or play with a ball in your dream symbolizes completeness and wholeness. It\nmay also indicate that you need to be more in tune with the inner child within.\nThe dream may also be a metaphor for the testicles. Consider also the phrase,\n\"he's got balls\" to indicate guts and strength.If\nyou dream of rolling a ball or see a ball rolling, then the dream may be\nmetaphor that you need to put your plan into action. It is time to stop idling\nand start moving things along. ", "BallPit": "\nsee a ball pit in your dream symbolizes celebration, joy and youth, especially\nif there are children playing inside it. It is a reminder to be more carefree\nand spontaneous.Dreaming\nthat you are inside a ball pit implies that you need to put in your full effort\ntoward a relationship or goal. Give it your all. ", "Ballerina": "\ndream that you are a ballerina suggests that you are moving through the\nobstacles of your life effortlessly. You feel unrestricted. It is also a symbol\nof innocence, frailty, and vulnerability. Alternatively, you may feel unable to\nattain and measure up to society's ideals of beauty.    ", "Ballet": "\ndream that you are watching a ballet symbolizes balance, cooperation, and\nharmony.", "BalletShoes": "\nsee or wear ballet shoes in your dream means that you need to approach a certain\nproblem or situation with attention, care and decisiveness. Wearing ballet shoes\ncan also imply that you are well balanced and level headed.   \n", "Balloon": "\nsee balloons in your dream indicate declining hopes and disappointments in your\nsearch for love. A situation in your life will take a turn downward. Balloons\nalso represent arrogance and an inflated opinion of yourself. ", "Ballot": "\nsee a ballot in your dream represents a decision that needs to be made. If your\nname is on a ballot, then it indicates that you are seeking support, approval or\nacceptance.   \n", "Ballroom": "\ndream that you are in a ballroom refers to some festivity or celebration. You\nare having a good time and enjoying life. Alternatively, the dream implies\nopenness. There are some aspect of your life that you need to be more open\nabout.    \n", "BallroomDancing": "\ndream that you are ballroom dancing indicates success in your endeavors. You\nhave a positive outlook in life and are willing try anything and give it your\nall.    \n", "Baloney*PleaseSee Bologna. Bamboo": "\nsee bamboo in your dream symbolizes trustworthiness, strength and resilience.\nYou are able to easily bounce back from setbacks and disappointments in your\nlife. Alternatively, it refers to strong ties/bonds and fair dealings.", "Bananas": "\nsee bananas in your dream may be a metaphor for repressed sexual urges and\ndesires. It is a phallic symbol and represents masculine sexuality.", "Band": "\nsee a band or play with a band in your dream represents a sense of community and\nbelonging. The dream may also be a pun on banding together and need for\ncooperation/unity.   \n", "Bandages": "\ndream that you have bandages indicate your need to heal. You may be feeling\nemotionally wounded and are trying to cover/shield your hurt from others. \nConsider where on the body was the bandage for more additional clues.", "Bandana": "\nsee or wear a bandana in your dream suggests that you need to look at issue or\nproblem more objectively. You need to think through your options more carefully.    \n", "Bandit": "\nsee or dream that you are a bandit indicates primitive sexuality and primal\nlust.   \n", "Banish*PleaseSee Exile.Banjo": "\ndream that you are playing a banjo represents togetherness. You need to cherish\nyour time spent with friends.", "Bank": "\nsee a bank in your dream denotes your desires for financial security. The dream\nmay be trying to offer reassurance and that your fears of financial instability\nare unfounded.", "*Pleasesee also Vault.Banker": "\nsee a banker in your dream suggests that you are experiencing financial\ndifficulties or money problems and may be too proud to get help. You are feeling\nout of control.Bankrupt", "Banner": "\nsee a banner in your dream indicates your willingness to stand up and fight for\na cause or common goal. A banner also means the need for better organization and\nplanning.    \n", "Banquet": "\ndream that you are at a banquet indicates that you are emotionally malnourished.\nYou are seeking emotional stimulation.   \n", "*PleaseSee Also Feast.Banyan": "\nsee a banyan tree in your dream represents shelter and protection. It also\ndenotes the connection between the spiritual and the earthly.    \n", "Baptism": "\nsee a baby being baptized in your dream represents renewal, a new way of being,\na new attitude toward life, or a new approach toward others. ", "Bar": "\ndream that you are at a public bar signifies your desire to escape from the\nstresses of your daily life and retreat into a light-hearted environment where\npleasure abounds. Alternatively, you are seeking acceptance in some aspect of\nyour daily life.  The dream may also be a pun on being \"barred\"\nfrom some place or something. You are feeling excluded or held back by\ncircumstances beyond your control. ", "*PleaseSee Prison.BarMitzvah / Bat Mitzvah": " dream\nthat you are at a bar mitzvah or bat mitzvah ceremony represents a transitional\nphase into adulthood.  It indicates your social responsibilities, sense of\nmorality, mental reasoning, and hopes.    \n", "Barbarian": "\nsee or dream that you are a  barbarian represents the savage and\ninstinctual aspect of your character. Perhaps you are being a little too rough\nor brash. Alternatively, the dream may also refer to your sexuality and\nyour wild side.   \n", "Barbecue": "\ndream of a barbecue refers to a minor issue or transformation occurring in your\nwaking life.  ", "BarbedWire": "\nsee barbed wire in your dream represents difficulty in breaking through or\ngetting your point across to someone.", "Barber*PleaseSee Hairdresser.Barber'sPole": "\nsee a barber's pole in your dream indicates that you are contemplating a change\nin your life. Alternatively, the symbol represents some childhood memory or a\npiece of nostalgia.   \n", "BarbieDoll": "\nsee a Barbie doll in your dream represents society's ideals.  You may feel\nthat you are unable to meet the expectations of others.  Alternatively, the\nBarbie doll refers to the desire to escape from daily responsibilities. It may\nserve to bring you back to your childhood where life was much simpler and more\ncarefree.   \n", "Barcode": "\nsee a barcode in your dream symbolizes automation, simplification and ease.\nAlternatively, the dream represents an impersonal relationship in your waking \nlife. You are feeling alienated.   \n", "Bareback": "\ndream that you are riding bareback represents your ability to balance several difficult\ntasks at once. Alternatively, to ride bareback in your dream also means that you\ngive your all into a project or relationship. You don't take the easy route when\nit comes to doing things.  \n", "Barefoot": "\ndream that you are barefoot represents your playful attitudes and relaxed,\ncarefree frame of mind. Alternatively, being barefoot indicates poverty, lack of\nmobility, or misunderstanding. You have low self-esteem and lack confidence\nin yourself. Or you may be dealing with issues concerning your self-identity. You\nare unprepared for what is ahead for you.", "Bargain": "\ndream that you are bargaining for something indicates that you are being\nundervalued. Perhaps you are not putting in as much effort into a project or\nrelationship as you should be.  Consider the symbolism of the item and how\nyou feel about it in your dream.   \n", "Baritone": "\nhear a baritone voice in your dream indicates deceit and suspicion. You need to\npay close attention to the words of the voice.   \n", "Bark": "\nhear barking in your dream suggests that you are annoying those around you with\ngrumpiness and fussiness. The dream may also be analogous to your tendency of\nbarking orders at people, instead of asking or talking kindly. Alternatively,\nbarking refers to unhappy and disgruntled companions.   Dreaming\nof the bark of a tree refers to your thick-skinned nature. If\nyou dream of clothing that is made of tree bark, then it indicates that you are\nputting up a protective barrier. You are not letting others get too close.\nAlternatively, the dream may mean that you are one with nature.  ", "Barley": "\nsee or eat barley in your dream signifies good health, progress, and\nsatisfaction with your life.   \n", "Barn": "\nsee a barn in your dream signifies the feelings that are kept in your subconscious. There is a possibility that you may be holding back your\ninstinctual action or natural urges.    \n", "Barnacles": "\nsee barnacles in your dream suggest that there is a situation you need to\nconfront head on before it gets out of control.   \n", "Barometer": "\nsee a barometer in your dream represents the state of your inner feelings and\nhow you are coping with emotions or situations.   \n", "Barracks": "\ndream that you are living in barracks suggest that you are in a restrictive\nsituation. You need to bring some change in your life.    \n", "Barrel": "\nsee an empty barrel in your dream signifies unfulfilled needs and emotional\nemptiness. If there is something inside the barrel, consider the significance of\nthe contents. If you are putting a stopper into a barrel, then it suggests that\nyou need to hold onto what you have. Perhaps you are feeling a little instable\nor insecure about your position or status in life.   \n", "Barrette": "\nsee or wear a barrette in your dream indicates that you are open to a new idea.\nAlternatively, you are ready to show the world a whole new you.   \n", "Barricade*PleaseSee BarrierBarrier": "\nsee a barrier in your dream represents an obstacle to your emotional growth. You\nmay feel hindered in fully expressing yourself.  The dream may also\nindicate your resistance to change.   \n", "Barrister": "\nsee a barrister with a white wig in your dream symbolizes wisdom and\nknowledge. The barrister may be a variation of the \"wise old man\"\nfigure. You are looking for guidance and help in some area of your life. \nPerhaps you are making an important decision.   \n", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  C                              Tweet                                               Page1CtoCastrationPage2CattoChiropractorPage3ChiseltoColonelChiseltoColonelPage4ColoradotoCorsagePage5CorsettoCystView              All \"C\" Symbols on One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  C": "\nsee the letter \"C\" in your dream symbolizes being average. It may also\nbe a pun on \"seeing\". The dream is drawing your attention to something\nthat you need to see or take notice. Pay attention!\nAlternatively, it may indicate the name\nor initial of a person.   \n", "Cab": "\ndream that you are hailing a cab suggests that you need to ask for help in order\nto be able to move forward in some waking situation. \n", "Cabana": "\nsee or dream that you are in a cabana signifies your need for an escape or\nvacation. You may be feeling overwhelmed by a waking problem and need some\ndowntime.  \n", "Cabaret": "\nwatch a cabaret in your dream indicates your need to acknowledge your sensual\nside.   \n", "Cabbage": "\nsee or eat cabbage in your dream suggests that you should not waste time with\npetty things in your life. You live and thrive on life's challenges.\nAlternatively, the dream refers to your unwise choices or decisions. You need to\nrethink some of your decisions.   \n", "Cabin": "\nsee or dream that you are in a wood cabin indicates that you will succeed via\nyour own means.  It suggests that you are self-reliant and independent, yet\nstill remain humble. You prefer the simpler things in life.", "Cabinet": "\nsee a cabinet in your dream symbolizes the female body and/or the womb.\nAlternatively, you may be hiding some family or personal secret. Consider the\ncontents and condition of the cabinet for more clues. ", "Cable": "\nsee a cable in your dream represents your stamina and durability. If the cable\nis frayed or broken, then it signifies a lack of strength.", "CableCar": "\nsee or ride in a cable car in your dream signifies the compromises that you make\nin life. Sometimes you have to go along with the masses in order to maintain the\npeace. Alternatively, the dream represents life's journey. You are headed in the\nright direction.   \n", "Caboose": "\nsee or be in a caboose implies that you are last in line for something. You are\nfeeling shortchanged. Alternatively, dreaming of a caboose serves as a reminder\nthat you will eventually get to where you need. It is not always about being\nfirst or finishing first.  \n", "Cackle": "\nhear the sound of cackling in your dream signifies illness and loss.  \n", "Cactus": "\nsee a cactus in your dream suggests that you are feeling invaded, that your\nspace is being crowded into and that you are being suffocated.  The prickly\nspines of the cactus represent the boundary you are trying to establish between\nyour personal and private. Or you feel the need to defend yourself in some way.\nAlternatively, the dream implies that  you have found yourself in a sticky\nsituation. Perhaps you need to adapt to your existing circumstances instead of\ntrying to change them.  \n", "*PleaseSee Also Succulents.Cadaver": " dream\nthat you are dissecting a cadaver indicates that you are ready to reveal or\nexpose an aspect of yourself that you have been hiding.", "Caduceus": "\nsee a caduceus in your dream symbolizes health concerns. The dream may be\ntelling you that you need to take better care of yourself.  \n", "CaesarianSection": " dream\nthat you are having a caesarian section implies that you need help in order to\nget your idea or project off the ground. You can not do it by yourself. A more direct\ninterpretation of this dream may represent your anxieties of having a C-section\nin real life.  \n", "Cafe ": "\ndream that you are at a cafe represents your social life. The dream is telling\nyou that it is time to call up old friends and catch up with what they are all\nup to.   \n", "Cafeteria": "\ndream that you are in a cafeteria denotes that there may be a lot of issues\n\"eating\" you up inside.  \n", "Cage": "\ndream that you are in a cage indicates that you are experiencing inhibitions and\npowerlessness in some areas of your life. You are feeling restricted, confined\nand restrained in a current relationship or business deal. Somebody may be\nkeeping a short leash on you, where you are lacking the freedom to act\nindependently. ", "CageFighting": " dream\nthat you are cage fighting indicates that you are feeling restricted or confined\nin a current relationship. An aspect of yourself is fighting to be expressed or\nlet out.", "Cake": "\nsee a cake in your dream indicates that you need to learn to share and allocate\nyour workload instead of trying to do everything yourself.  Cakes also\nsymbolize selfishness or the feeling of not getting your fair share. More\npositively, the dream may represent your accomplishments and achievements.\nConsider also the metaphor a \"piece of cake\" or some situation that is\neasy.", "Calamari": "\ndream that you are eating calamari indicates that you are feeling battered or\nbeaten. However, you are tough. Hang in there!  \n", "Calculator": "\nsee a calculator in your dream suggests that you need to thoroughly think\nthrough some problem and carefully evaluate your choices.  You need to lay\nout some sort of plan or outline. The symbol may also be a metaphor for someone\nwho is \"calculating\", cunning and scheming.  \n", "Calendar": "\nsee a calendar in your dream represents the passing of time and past events. The\ndream may also be a reminder of a special event, appointment or important date\nin your waking life.  \n", "Calf": "\nsee a calf in your dream symbolizes immaturity and inexperience. You need to\ndevelop certain qualities.  \n", "Caliper": "\nsee or use a caliper in your dream reflects your concerns about not measuring up\nto the standards or expectations of others. Alternatively, dreaming of a caliper\nmeans that you need to be careful in making a decision or judgment.    \n", "CallaLily": " see\ncalla lilies in your dream symbolize new beginnings, rebirth and longevity. In\nparticular, a white calla lily represents purity, simplicity or elegance.\nAlternatively, the calla lily refers to a commitment.   \n", "CallingCard": "\nsee or use a calling card in your dream indicates that there is someone that you\nneed to reach out to. If the calling card has the name of someone you know on\nit, then it means that their presence is with your spiritually, even though they\nmay not be with you physically. Something in your waking life is reminding you\nof this person.    \n", "Calluses": "\ndream that you have calluses symbolize hard work. You have be laboring over a\ndifficult task or situation.  \n", "Calm": "\ndream that you are calm denotes a fulfilling life. You find contentment and\nsatisfaction in what you have.", "Calomel": "\nsee calomel in your dream indicates a rivalry.", "Calves": "\nsee your calves in your dream symbolize movement and your ability to jump from\nsituation to situation. In particular, if you are admiring your own calves, then\nit denotes a needy or codependent relationship.  \n", "Camcorder*PleaseSee VideoCamera.Camel": "\nsee a camel in your dream denotes that you need to be more conservative; you are\ncarrying too many responsibilities, burdens and problems on your shoulders.\nConsider the common phrase, \"the straw that broke the camel's back\". You\ntend to hold on and cling on to your emotions instead of expressing and\nreleasing them. Learn to forgive and forget. Alternatively, the camel represents\nyour stamina. ", "Cameo": "\nsee or wear a cameo in your dream represents an aspect of yourself that you are\ntrying to express. Perhaps you are showing your delicate and feminize side.\nAlternatively, the dream may be a pun on a \"cameo\" appearance that you\nare making at some social gathering.  \n", "Camera": "\nsee a camera in your dream signifies your desires to cling on and/or live in the\npast. Alternatively, it may indicate that you need to focus on a particular\nsituation. Perhaps you need to get a clearer picture or idea.", "Camouflage": "\ndream that you are in camouflage suggests that you are hiding  your true\nself and feelings. You are concealing who you really are. Alternatively, there\nis a situation in your waking life that is making you want to blend into the\nbackground and not get noticed.  \n", "Camper": "\ndream that you are living in a camper indicates that you need to move on with\nsome situation or some aspect of your life. You may be dwelling on a situation\nand it is time to move forward. Alternatively, you may be expressing your desire\nto be more independent and self-sufficient.  \n", "Campfire": "\nstart or see a campfire in your dream represents sharing and companionship. You\nneed to open yourself to others and allow others to get to know you.  \n", "Camping": "\ndream that you are camping indicates a need for relaxation and a long-deserved\nbreak.  You need to be more in touch with nature and go back to a more\nbasic and simpler life. Alternatively, it refers to your social circle and\nsupport group. You are looking for a sense of belonging, but at the same time be\nself-sufficient and independent.   \n", "Campus": "\ndream that you are on a campus indicates your need to expand your\nthinking/knowledge and challenge yourself mentally.  \n", "Can": "\nsee a can in your dream indicates that there is something in your past that you\nneed to hold on to and preserve. The dream may also be a pun on how you\n\"can\" do something. Don't underestimate your abilities and talents.", "CanOpener": "\nsee a can opener in your dream indicates your willingness to accept new ideas\nand new concepts. It may also be a symbol of reassurance and a way to tell\nyourself that \"I can\" do something.  \n", "Canada": "\ndream that you are in Canada depends on your own personal associations with the\ncountry. If you have never been to Canada, then you will need to draw on your\nown preconceptions and feelings of the country.   \n", "Canal": "\nsee a canal in your dream symbolizes restraint and constricted emotions. It also\nsuggests that you are unyielding in your thinking and beliefs, which may hinder\nyou in the pursuit of your goals. You are being too controlling.  \n", "Canary": "\nsee a canary in your dream represents happiness and harmony. Alternatively, the\ndream could indicate your desires for a relationship or that a new relationship\nis blossoming.  \n", "Cancel": " dream\nthat you are canceling an appointment or plans suggests that you are afraid to\nconfront some matter. You don't want to face the facts.Dreaming\nthat your flight was cancelled indicates that you are feeling helpless or\ntrapped by some situation. You feel you are being held back, either physically\nor mentally.  \n", "Cancer": "\ndream that you have cancer denotes hopelessness, grief, self-pity, and\nunforgiveness. You feel you are wasting your life away. This dream also\nrepresents areas in your life which are bothering you, disturbing you, and\nhurting you in some emotional way. An emotional issue is eating away at\nyou.", "Candle": "\nsee a burning candle in your dream signifies that good luck and hope will be\ncoming your way in small and steady amounts. You are in a comfortable stage in\nyour life and may be seeking spiritual enlightenment. Lit candles are also\nsymbolic of intellect, enlightenment, awareness or the search for truth.", "CandleWax": "\nsee candle wax in your dream indicates that there is too much activity going on\nin your life. You may need to slow down and take a breather. Alternatively, it\nmay symbolize the passage of time.  \n", "Candy": "\nsee or eat candy in your dream symbolizes the joys and the special treats in\nlife. It also represents indulgence, sensuality and/or forbidden pleasure. You\nmay be devoting too much time to unimportant issues. A more direct\ninterpretation suggests that you are eating too much candy and sweets.  \n", "CandyApple": "\nsee or eat a candy apple in your dream is a reminder that you can have too much\nof a good thing. You need to show restraint in some area of your life.  \n", "Cane": "\nsee or use a cane in your dream suggests that you are in need of some support\nand advice. The cane may also represent someone you trust and can rely on.", "Cannabis*PleaseSee Marijuana. CannedFood": "\nsee or eat canned food in your dream implies that you are keeping your emotions\nbottled up inside. You feel that it is not the appropriate time to express your\ntrue desires.  \n", "Cannibalism": "\nsee cannibalism in your dream symbolizes a destructive and forbidden desire or\nobsession. Metaphorically, cannibals consume people's lives, along with\ntheir energy. Thus, this dream may then denote an aspect of your life (career,\nrelationship, children, etc ), which is consistently draining your enthusiasm\nand vitality.", "Cannon": "\nsee a cannon in your dream suggests that there is something drastic that needs\nto be done immediately. According to the Freudian school of thought, the cannon\nsymbolizes the penis.   \n", "Cannonball": "\nsee a cannonball in your dream indicates that you are harboring some anger or\naggression and it is weighing your down.  \n", "Canoe": "\nsee a canoe in your dream represents serenity simplicity, and independence. It\nis also a reflection of your emotional balance. You are moving ahead via your\nown power and determination.Canopy", "Cantaloupe": "\nsee or eat cantaloupe in your dream implies that you put forth a tough image,\nbut are sensitive on the inside. Metaphorically, cantaloupes can refer to the\nbreasts.  \n", "Canteen": "\nsee or use a canteen in your dream suggests that you are looking to easily and\nconveniently satisfy your emotional needs.  \n", "Canvas": "\nsee a canvas in your dream symbolizes potential and possibilities, especially if\nthe canvas is blank. Consider the significance of what is on the canvas, as it\nis an aspect of your subconscious.  \n", "Canyon": "\nsee a canyon in your dream represents your subconscious mind and hidden feelings.\nIt may point to emotions and relationships that you did not recognize.  \n", "Cap": "\nsee a cap in your dream signifies informality and ease. It also suggests that\nyou need to be more tolerant of others.  \n", "CapAnd Gown": "\nwear a cap and gown in your dream indicates that you are transitioning into a\nhigher level in your life. You are ready to move on to the next stage. \n\n", "Cape": "\nsee or dream that you are wearing a cape indicates that you are trying to shield\nyourself from being emotionally hurt. It may also mean that you are trying to\ncover-up or hide something.  \n", "CapitalPunishment*PleaseSee DeathPenalty.Capricorn": "\ndream that someone is a Capricorn signifies fears of inadequacy. You are afraid\nthat you are not measuring up. Alternatively, it denotes your drive, tenacity\nand ambition.  \n", "Capsize": "\ndream that your boat has capsized represents your avoidance in confronting\nuncomfortable feelings and/or situations.   \n", "Captain": "\ndream that you are a captain indicates that you are taking charge of your\nemotions and confronting the issues that are bothering you.", "Captive": "\ndream that you are held captive suggests that you are feeling trapped in some\naspect or circumstances of your waking life. You may feel trapped in your\ncareer, relationship or life in general. Alternatively, captivity dreams\nindicate something you are refusing to acknowledge or something that you are in\ndenial about.   \n", "Car": "\ndream that you are driving a car denotes your ambition, your drive and your\nability to navigate from one stage of your life to another.\nConsider how smooth or rough the car ride is. If you are driving the car, then\nyou are taking an active role in the way your life is going. However,\nif you are the passenger, then you are taking a passive role. If you are in the\nbackseat of the car, then it indicates that you are putting yourself down and\nare allowing others to take over. This may be a result of low self-esteem\nor low self-confidence.  Overall, this dream symbol is an indication of\nyour dependence and degree of control you have on your life. Driving\na new car means that you are headed toward a new direction or goal. You are\ndeviating from your original life path.", "CarAlarm": " hear\nor set off a car alarm in your dream implies that you are headed on the wrong\npath. The dream is alerting you to change  your direction and alter your\ncourse.  \n", "CarBattery": "\nsee your car battery in your dream symbolizes your stamina.", "CarCarrier": "\nsee a car carrier in your dream indicates that you are lacking direction and\nhave no goal of your own. You are letting others make decisions for you. You are\ngoing with the flow.  \n", "CarDealership": "\nsee or dream that you are in a car dealership refers to some decision that you\nneed to make about where you want to go in life. You are trying to figure out\nyour life path.   \n", "CarSeat": "\nsee an infant car seat in your dream implies that you are in control of someone\nelse's direction or destiny in life. Alternatively, the dream refers to the\nbeginning stages of your life journey. You are just getting started on an\nimportant path.  \n", "CarShow": "\ndream that you are at a car show suggests that you are drawn to a flashy\nlifestyle which may not necessarily be who you really are. ", "Caramel": "\neat or lick caramel in your dream indicates a sweet and satisfying situation\nwill eventually turn into \"sticky\" problem. If it sounds too good to\nbe true, then it is really too good to be true.  \n", "Caravan": " dream\nthat you are part of a caravan means that you will achieve your goals with the\nsupport of others. You do not need to do things by yourself.  \n", "Carburetor": "\nsee the carburetor in your dream represents emotional, spiritual and physical\nbalance.  \n", "Carcass": "\nsee a carcass in your dream indicates that you are feeling emotionally torn. You\nfeel that you are literally being ripped apart.   \n", "Cardboard": "\nsee a cardboard box in your dream indicates a lack of protection against risk.  \n", "Cardinal": "\nsee a cardinal in your dream represents vitality and happiness. It also may mean\nbeing in first place or your position at the front.  \n", "Cards": "\ndream that you are playing a game of cards represents your ability to strategize\nin various areas of your life. In particular, diamonds indicate wealth and\nmaterialism, clubs indicate work and industry, hearts indicate happiness in\nlove, and spades indicate troubling times and disappointments.", "Cargo": "\ndream that you are loading or carrying cargo refers to a heavy load that you are\ncarrying around.  You are feeling overburdened or\noverwhelmed. If\nyou are unloading cargo in your dream, then it indicates that you are ready to\nrid yourself of the extra weight, negative habits and/or excesses that are\nholding you back. It is time to let go.Carjack", "Carnation": "\nsee carnations in your dream symbolize light-heartedness, vitality and joy.\nAlternatively, it may represent bachelorhood. Consider the color of the\ncarnation for additional significance.  \n", "Carnelian": "\nsee a carnelian in your dream represents passion, lust, sexuality, or matters of\nthe heart.  It also indicates a need for spiritual healing.  \n", "Carnival": "\ndream that you are at the carnival represents falsehoods and deception. If you\nobserve freakish sights, then it denotes a lack of harmony in your domestic\nlife. Much sorrow will arise in what were thought to be pleasant times.", "Caroling": "\ndream that you are caroling signifies joy, harmony and tranquility. You are in a\nfestive and upbeat mood.  The dream may also be a pun on someone who is\nnamed \"Carol\".  \n", "Carousel*Pleasesee MerryGo Round.Carp": "\nsee a carp in your dream indicates that you need to put aside your pride and ego\nand not let it get in the way of friendships and relationships. Alternatively,\nthe carp is symbolic of patience, perseverance, determination, tenacity, courage\nand success.   \n", "Carpenter": "\nsee or dream that you are a carpenter indicates that you are confronting and\novercoming your obstacles. Alternatively, it suggests that you need to change\nyour way of thinking and readjust your attitude.Carpet", "*PleaseSee Also RedCarpet.Carriage": "\nsee an old-fashioned carriage in your dream suggests that your ways of thinking\nmay be too outdated and antiquated. The carriage is also a symbol of power and\nstatus.  \n", "CarromBoard": " see\nor play with a Carrom Board in your dream implies that you need to focus on your\ngoals. Alternatively, the dream indicates that you are trying to shield or\nprotect a loved one from some problem or issue.  \n", "Carrot": "\nsee a carrot in your dream signifies abundance and fertility. It may also\nsymbolize a lure as in the idiom \"to dangle a carrot\".", "Carry": "\ndream that you are being carried suggests that you are feeling like a burden to\nsomebody. You need to be more independent and take on more responsibilities.\nAlternatively, it may elude to romance.   \n", "Cartoon": "\ndream that your real life is depicted in a cartoon world suggests that you are\nperceiving the world in a comical and unserious manner. This dream may also\nserve as an escape from the stressful realities of your life. It is your way of\nobtaining moments of lightheartedness and fun. Additionally, you need to learn\nto laugh at yourself and at your mistakes.", "*PleaseSee Also CartoonCharacter.Cartwheels": "\ndream that you are doing cartwheels represent poise and balance in your life or\nthe need to regain balance. You need to handle life's obstacle and stress with\nmore fortitude. ", "Carving": "\ndream that you are carving a piece of wood symbolizes spiritual and creative\nenergy. Metaphorically, you are transforming subconscious energy into conscious\nawareness. Consider whether the carving is purely ornamental or utilitarian.", "Carwash": "\ndream that you are at a carwash indicates that you need to clean up your\nself-image. You are ready for a fresh start.  \n", "Cash*PleaseSee Money.CashRegister": "\nsee a cash register in your dream represents financial worries and concerns. You\nare assessing your financial situation. On the other hand, you may be expecting\nmonetary gains.   \n", "Cashier": "\nsee or dream that you are a cashier indicates that you are re-evaluating your\nlife and what you have accomplished.  Alternatively, it suggests that you\nhave removed yourself out of some situation. You have \"checked out\".  \n", "Cashmere": "\nfeel or wear cashmere in your dream symbolizes luxury. You strive for the finer\nthings in life. Alternatively, dreaming of cashmere suggests that you are\nlooking for warmth and comfort in your relationships.Casino", "Casket": "\nsee a casket in your dream symbolizes the womb. It also signifies your thoughts\nand fears of death. If the casket is empty, then it denotes irreconcilable\ndifferences. Alternatively, the coffin represents ideas and habits that are\nno longer of use and can be buried. In particular, if the casket is white, then\nit refers to lost innocence.  \n", "": "\nsee a body in a casket in your dream signifies that you are going through a\nperiod of depression. You may feel confined, restricted and that you are lacking\npersonal freedom. There may be a dead or decaying situation or issue in your\nlife that you need to address. It is time to end this situation or relationship.Casserole", "CassetteTape": "\nsee a cassette tape in your dream suggests that there is worth and truth in what\nyou are saying. Alternatively, the dream means that you need to get out of the\nsame rut. You are going around in a loop.  \n", "Cassowary": " see a\ncassowary in your dream refers to your shy nature. You try to avoid\nconfrontation and arguments.   ", "Cast": "\ndream that you are wearing a cast suggests that your motion is being inhibited\nin some way. Or that you need to show some restraint in an area of your life.\nConsider which part of the body is in a cast. Alternatively, a cast symbolizes a\ntime of healing and discipline.  \n", "Castanets": "\nsee, hear or play with castanets in your dream  represents little\nannoyances and irritations in your waking life. Alternatively, the dream may be\na metaphor that you need to \"cast-a-net\". Perhaps you are looking for\nsome assistance.  \n", "Castle": "\nsee a castle in your dream signifies reward, honor, recognition, and praise for\nyour achievements. You are destined to a position of power, wealth, and\nprestige. Alternatively, the dream indicates your desire to escape from\nlife's daily problems.", "Castration": "\ndream of a castration signifies your overwhelming fears that you have lost your\nvirility. You are feeling the pressures of your sexual performance.\nAlternatively, it represents a lack of creativity, power or strength.  \n", "  ": "\ndream that you are in a cab indicates that you are being taken for a ride.\nSomeone is taking advantage of you.  \n", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: chase dreams                          Tweet                                               \"I'mBeing Chased!\"Beingchased in your dream is one of several common dream theme stemming from feelings of anxietyin your waking life. In such dreams, you could be running from an attacker, ananimal, a monster or some unknown figure who wants to hurt or possibly kill you.Fight or flight is an instinctive response to a physicalthreat in the environment. Thus it is natural to run or hide or try to outwityour pursuer. Beingchased signifies avoidance:": "\ndream that you are being chased is an indication that you are avoiding some\nissues in your waking life. The actions in your dream exemplify how you respond\nto\npressure and cope with fears, stress or various situations. Instead of confronting the situation,\nyou have a\ntendency to run away and avoid issues that you are uncomfortable with\naddressing.. Being\nchased signifies close-mindedness :If\nsomeone is chasing you in your dream, then it may also refer to your\nclose-mindedness. You are refusing to acknowledge a certain viewpoint or idea\nand don't even want to give a listen to any opinion that is different from\nyours.Being\nchased signifies running away from yourself :Another\nway to analyze your chase dream is how the pursuer or attacker may be an aspect\nof your own Self. Perhaps you are suppressing or rejecting certain feelings or\ncertain characteristics of your Self. Anger, jealousy, fear, and even love can manifest\nas a threatening figure in your dream. And you could  be projecting these\nfeelings onto the unknown chaser. Being\nchased signifies fear :Running\nfrom an attacker in your dream may simply\nrepresent your fear of being attacked. Such\ndreams are more common among women than men, who may feel physically vulnerable\nin their surroundings. All you have to do is turn on the news to hear stories of\nviolence and sexual assault. You\nare the one chasing:\nIf you are the one doing the chasing, then the dream may highlight your drive\nand ambition to go after something you want, or go after someone you want. On\nthe other hand, it may also mean that you are falling behind in some aspect of\nyour life and are having to catch up to others. Conclusion:In\nunderstanding your own dream of being chased, ask yourself who is chasing you so\nthat you can gain a better understanding .  What\nare you running from? Turn around and confront your pursuer and ask them why\nthey are chasing you. \n\n\nConsider the distance or gap between you and your pursuer. This indicates your\ncloseness to the issue. If the pursuer is gaining on you, then it suggests that\nthe problem is not going to go away. The problem will surround you, until you\nconfront and address it. However, if you are able to widen the gap between your\npursuer, then you are able to successfully distance yourself from the problem.\nIn essence, the problem is fading away.\n  \n\n  other\ncommon dream themes: chase\ndreams   cheating\ndreams   death\ndreams   falling\ndreams   flying\ndreams   naked\ndreams   snake\ndreams   teeth\ndreams  test\ndreams  \n    \n\n\n\n   \n      Tweet\n\n\n\n\n\nChase\n      Dreams Submitted By Our VisitorsGodzilla\n      in KmartCan't\n      Reach BoyfriendChased\n      By A SpiderCrocodile\n      Chase This\nweb site designed and maintained by Dream\nMoods, Inc.\nEmail the webmaster at dreammoods dot com with questions or comments about this\nweb site.\nView our Disclaimer and Privacy\nPolicy.\nCopyright  2000-2017 Dream\nMoods, Inc. All rights reserved. . Last\nUpdated: February 22, 2017", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: cheating dreams                         Tweet                                               \"MyBoyfriend Cheated On Me!\"   Beingcheated on in a dream can often feel so real that you actually go and accuseyour spouse, boyfriend, girlfriend or significant other of it. Such dreams areunsettling and disturbing. It often leaves you questioning your relationship.Often dreams about infidelity are rarely about cheating, but rather more aboutyour own feelings of insecurity. So what is this dream exactly about?Beingcheated on points to neglect:Alack of attention from your mate may trigger a dream where your mate is havingan affair. Since they are not paying attention to you, then you start to think thattheir attention is focused on someone else. Perhaps your significant other isworking longer hours or traveling more or spending more time at the gym. All isinnocent, but your dreaming mind manifests time spent away from you as anaffair.Beingcheated on points to fear of abandonment:": "\ndream that your mate, spouse, or significant other is cheating on you also indicates\nyour fears of being abandoned. You are concerned about the future and whether\nyour significant other will be there for you. Perhaps you are waiting for a\ncommitment from your significant other. Often such dreams may occur because you\nwere abandoned before by an ex, by a parent or important person in your life.Being\ncheated on points to low self-esteem:When\nyou feel unworthy, inadequate or that you do no measure up to the expectation of\nothers, you may dream that your lover is cheating on you. You have a low sense\nof self-worth and feel that there is no reason for your mate to stay with\nyou. Consider who your significant other is cheating with in your dream. Is\nthis person someone who you think is better than you in some way? Are they\nhandsomer, prettier, thinner, richer, smarter, etc?Being\ncheated on points to lack of trust:Trust\nis an important element in a relationship. If that trust is compromised, then\nyou may express doubt in the relationship. One of these doubts can manifest\nitself as a adulterous dream. Being\ncheated on points to actual cheating:In\nrare cases, your cheating dream may be about actual cheating in your relationship. You\nmay be overlooking cues or hints that your subconscious is picking\nup to indicate that your significant other is not being completely truthful\nor is not fully committed in the relationship.\nOr perhaps you have been in denial about the infidelity. Being\nthe cheater in your dream:", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  D                              Tweet                                               Page1DtoDestructionPage2DetectivetoDominatrixPage3DominoestoDystopiaDominoestoDystopiaView              All \"D\" Symbolsin One PageDreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  D": "\nsee the letter \"D\" in your dream signifies mediocrity. Alternatively,\nthe letter D refers to receptiveness and joy. As a Roman Numeral, it could\nrepresent the number 500.Dachshund", " going the way you want it to. Perhaps the choices youare making are self-destructive.  Dagger": "\nsee or use a dagger in your dream represents some \"cutting remark\".\nPerhaps you feel that you have been stabbed in the back.", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: death dreams                         Tweet                                               \"IDied In My Dream Last Night\"   Deathdreams can be quite jarring and scary as if it was a premonition of your own imminentdeath or a death of a loved one.However, thereis no need to be alarmed or panic. And no you do not actually die if you do not wake upbefore you die in your dream.  In order to best understand your dream ofdying, it is important to look at what is going on in your waking life that mayhave triggered such a dream.Deathmeans new beginnings:Dreamingof your own death symbolizes inner changes, transformation,self-discovery and positive development that is happening within you or yourlife. You are undergoing a transitional phase and are becoming more enlightenedor spiritual.Big changes are aheadfor you where you are making a new start and leaving the past behind. If youare getting married or divorce, being promoted to a new position, moving to a new country,you may experience dreams of your own death. If you dream of faking your death,then it suggests that you are taking control of your life and making a fresh start. You wantchange in your life. Ifyou dream that your ex has died is your subconscious's way of telling you that therelationship is dead and that you are moving on. ": " dream about the death of your living parents\nindicates that you are undergoing a significant change in your waking life. Your\nrelationship with your parents has evolved into a new realm. As a child reaches certain\nmilestones and grows into an adult, dreaming of their death is symbolic of\ntheir own self-discovery, transition and transformation into a new stage of\nlife.Death\nmeans a part of you has died: Metaphorically,\ndying can be seen as an end or a termination to your old ways, bad habits,\ndestructive behavior or some\nother aspect of yourself. So dying does not always mean a physical death, but rather an ending of something. In\nsuch dreams, the death is often represented by someone else. So if you dream\nthat someone is dead, then it means that you want to repress that aspect of yourself that\nis represented by the dying person. Whatever that person represents has no part in your own life\nanymore.  Generally, dreaming\nabout someone's death implies that your feelings for that person are\ndead or that a significant change/loss is occurring in your relationship with\nthat person. If you see a stranger die in your dream,\nthen it implies that you are feeling detached from the changes that are\nhappening around you. If you dream about the death of a child, then it\ninidicates that you need to let go of your immaturity and start being more\nserious. The death of a child can also mean that your inner child is being\nstifled.Death\nmeans a wake-up call:The\nfrightening and alarming nature of death can in itself be a wake- up call for\nsomething. It is your mind's way of trying to grab your attention to something\ndire in your waking life where you need to take action. Consider how you felt in\nyour dream and think about a situation in your waking life where you felt the\nsame way.For\nsome, dreaming of your own death may be a health warning. Perhaps you\nhave been putting off a doctor visit. Or perhaps you need to make some unhealthy\nlifestyle\nchanges.Death\nmeans escape:", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  E                              Tweet                                               Page1EtoEndCreditsPage2EnemytoEyesightView        All \"E\" Symbols on One PageE": "\nsee the letter \"E\" in your dream implies ease and relaxation. The drug\necstasy is often referred to as \"E\".Eagles", " enlightenment.  You need to dedicate yourself to your goals,family, career, etc. The direction east also symbolizes the sun. Since east isrelated to the direction right, it can suggest that you are headed in the rightdirection.Easter": "\ndream about Easter suggests that the worst of your problems are over. Things\nwill look up for you after a period of darkness and sadness. It is time to walk\nwith your head held high and stop being ashamed.  Alternatively, the dream\nsymbolizes resurrection and spiritual rebirth.Easter\nEgg", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  F                              Tweet                                               Page1FtoFightingPage2FigstoFlyTrapPage3FlyingtoFuzzyFlyingtoFuzzytoFuzzyView              All \"F\" Symbols in              One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  F": "\nsee the letter \"F\" in your dream symbolizes failure. It may also\ndenote an expletive as in \"F you\".Fable", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: falling dreams                          Tweet                                               \"I'mFalling!\"Anothervery common dream is the dream where you are falling from a cliff, a building, arooftop, an airplane or from some higher ground. Contraryto a popular myth, you will not actually die if you do not wake up before youhit the ground from the fall. ": " understand your falling dream, you need to look\nto what is going on in your waking life.Falling\nsuggests loss of control:When\nyou fall, you have no control and have nothing to hold on to. Thus your falling\ndream is analogous to a situation in your waking life where you are lacking or\nlosing control. You are feeling overwhelmed,\nperhaps in school, in your work environment, in your home life or maybe in your\npersonal relationship. You have lost your foothold and unable to keep\nup with the demands of your daily life.Falling\nsuggests insecurity:Falling\nin your dream means you are lacking any sense of security, stability and\nconfidence. You are\nnot sure where you stand in a particular circumstance or in your relationship.\nPerhaps you are at risk of losing your job or losing your home. Such loss can\nmake you feel that the ground is falling away underneath you. Moreover falling\ndreams also indicate feelings of shame, inferiority, vulnerability, and/or low\nself-esteem. You are afraid of not measuring up to others' expectations or to\nkeep up with the status quo. If you have recently have demands placed on you,\nthen it would not be surprising if you dreamt of falling.Falling\nsuggests reckless behavior:Your\nfalling dream may be a wake-up call of your reckless behavior or poor\ndecisions. You are headed the wrong way in life. And if you continue on the current path,\nyou are going to hit rock bottom. Falling in your dream could be viewed as an\nanalogy of your fall from grace. \n\n\nFalling suggests sex:According to Freudian theory, dreams of falling\nindicates that you are on the verge of giving in to your sexual urges or\nimpulses. You are lacking\nindiscretion.Falling\nis a result of physiology:The\nphysiological changes within the body when you \"fall asleep\" may\nactually trigger a falling dream. When you dream of falling, you may feel your\nwhole body jerk or twitch. This sudden jolt is known as a myoclonic jerk and is\nsometimes strong enough to wake you up.Conclusion:In\norder to understand and interpret your falling dream, look\nat what is happening in your waking life that could bring about the dream. Where\nin your life do you feel a lost of control? What is causing your\ninsecurities?    \n  \nother common dream themes: chase\ndreams   cheating\ndreams   death\ndreams   falling\ndreams   flying\ndreams   naked\ndreams   snake\ndreams   teeth\ndreams  test\ndreams\n  \n    \n\n\n\n   \n      Tweet\n\n\n\n\n\n\nGet\n        the Dream Moods app for your smartphone or tablet! \n \n \n\n \n\n\n\n\n\n\n\n\n\n\n\nGet\n        the Dream Moods app for your smartphone or tablet! \n \n \n\n \n\n\n\n\n\n\n\n\n\n\n\n   This\nweb site designed and maintained by Dream\nMoods, Inc.\nEmail the webmaster at dreammoods dot com with questions or comments about this\nweb site.\nView our Disclaimer and Privacy\nPolicy.\nCopyright  2000-2017 Dream\nMoods, Inc. All rights reserved. . Last\nUpdated: February 22, 2017", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: flying dreams                         Tweet                                               \"I'mFlying!\"Flyingdreams fall under a category of dreams known as lucid dreams. Lucid dreams occurwhen you realize that you are dreaming and then take control of the dream. Many dreamers describe the abilityto fly in their dreams as an exhilarating, joyful, and liberating experience.Flyingrepresents control:If you are flying with ease and are enjoying the scene and landscape below, thenit suggests that you are in charge and on top of a situation. You have risen above something. Flying dreams and the ability to control your flight is representative of yourown personal sense of power.Flyingrepresents a new perspective:Whenyou are flying, you have the ability to look down and get a wider perspective ofthings. As a result, your flying dream is telling you to look at the broaderpicture. From your higher vantage point, you can gain a new and different perspective on things. Flyingrepresents freedom:Yourdream flight may be sending you a message that nothing is impossible; you can be anybody and do anything.Your ability to fly signifies hope, possibilities, reality and freedom ofexpression. It may also reflect your strong will and is a reminder for you notto give up. Nobody can tell you what you cannot do and accomplish.Such dreams can provide great motivation and renewed sense of freedom.Flyingrepresents spiritual connection:In some cases, your flying dream indicates that you have reached a higherspiritual connection. You are growing more in tune with your spirituality andyour dream of flight is a reflection of this. Flyingrepresents escape:": "\ndream of flying can also function as an escape from the stresses and pressures\nof your everyday life. Instead of confronting your daily problems, you take\nflight and try to get away from it all.Flying\nrepresents inflated sense of self.When\nyou are flying, you may feel like you are a superhero. You feel invincible and\nundefeatable. Perhaps you think you are better than everyone else and have a\ntendency to look down on others. After all, when you are flying, you are\nactually looking down on them. Conclusion:When\nanalyzing your flying dream, consider the significance of the the height,\ndirection and speed of your flight. Flying high and/or fast is analogous to your\nlevel of confidence. If you are flying low, then it indicates that you are\ncontent with the pace of your current life. Flying\nbackwards implies that you are reminiscing about your past.Usually\na flying dream is described as a positive and exhilarating experience, but if you are feeling fear\nwhile flying,  then it suggests that you are afraid of new challenge and of success. Perhaps you\nare not ready to take the next step. Having difficulties staying in flight indicates a lack of power in controlling\nyour own circumstances. Things like power lines, trees, or mountains may be obstacles that you\nencounter in flight. These obstacles symbolize something or someone who is\nstanding in your way in your waking life. You need to identify what or who is\ntrying to prevent you from moving forward. Difficulty flying may also be an\nindication of a lack of confidence, lack of motivation or some hesitation on your part.\nPerhaps you  have set unrealistic goals for yourself and now you are\nstruggling to meet those goals.   other\ncommon dream themes:  chase\ndreams   cheating\ndreams   death\ndreams   falling\ndreams   flying\ndreams   naked\ndreams   snake\ndreams   teeth\ndreams  test\ndreams   \n    \n\n\n\n   \n      Tweet\n\n\n\n\n\nFlying\n      Dreams Submitted By Our VisitorsExhilarated\n      FlyingI\n      Can Fly And I'm Not CrazyHard\n      Landing..other\n      dreams from the Dream Bank This\nweb site designed and maintained by Dream\nMoods, Inc.\nEmail the webmaster at dreammoods dot com with questions or comments about this\nweb site.\nView our Disclaimer and Privacy\nPolicy.\nCopyright  2000-2017 Dream\nMoods, Inc. All rights reserved. . Last\nUpdated: February 22, 2017", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  G                              Tweet                                               Page1GtoGillsPage2GingertoGrapefruitPage3GrapestoGypsyView              All \"G\" Symbolsin One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  G": "\nsee the letter \"G\" in your dream may be a pun on money.G-String*Please\nSee ThongGag", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  H                              Tweet                                               Page1HtoHearsePage2HearttoHologramPage3HolyChildtoHysterectomyView              All \"H\" Symbols in              One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  H": "\nsee the letter \"H\" in your dream symbolizes cooperation, balance and\nteamwork.Habit", " you have hair so long that it gets in your way suggests that your thoughtsand/or ideas are preventing you from moving forward. Perhaps you are doing toomuch thinking and not taking any action. ": "\ndream that you have short hair implies that you need to downsize your\nlifestyle. ", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  I                              Tweet                                               Page1ItoInfinityPage2InflatableBedtoIvyView        All \"I\" Symbols on One PageI": "\nsee the letter \"I\" in your dream is on pun on me, myself and I. You\nneed to focus on you. Or the dream may be an indication that you are being too\nselfish. Alternatively, the letter represents action and responsibility.Ibis", " or that you really feel acertain way.": "\ndream that someone is indifferent towards you implies that you are unsure of\ntheir intentions or feelings. Indigo", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  J                              Tweet                                               Page1JtoJusticeJ": "\nsee the letter \"J\" in your dream means that there is something that\nyou need to hold on to and grasp, as reflected by its hook shape. Alternatively,\nthe dream may be a pun on someone named \"Jay\" or whose initial starts\nwith J.Jab", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  K                              Tweet                                               Page1KtoKumquatsK": "\nsee the letter \"K\" in your dream implies\nthat something is \"okay\". Alternatively, the dream may be a pun\non someone named \"Kay\" or whose initial starts with K.Kabbalah", " yourself. Killing represents the killing off of theold parts and old habits. Alternatively, the dream represents feelings of beinglet down or betrayed by someone in your waking life. You are feelingoverwhelmed, shocked and disappointed.*Pleasesee also Murder.Killer": "\nsee a killer in your dream suggests that an essential aspect of your emotions\nhave been cut off. You feel that you are losing your identity and your\nindividuality. Alternatively, this dream may represent purification and the\nhealing process. You are standing up for yourself and putting a dramatic end to\nsomething.Killer\nWhale", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  L                              Tweet                                               Page1LtoLeavingPage2LecturetoLipPiercingPage3LipSynchingtoLyreView              All \"L\" Symbolsin One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  L": "\nsee the letter \"L\" in your dream is symbolic of loser. Alternatively,\nthe dream may suggests that you need to take a break from whatever you are\ndoing. The letter L may also signify your fear of the \"l-word\". You\ncannot even bring your dreaming mind to express love.Lab\nCoat", "earth. You are looking for a strong foundation and some stability.Alternatively, the dream may be a metaphor for something that you have\"landed\" as in a job, a part in a play, etc.   ": "\nsee rocky or barren land denotes failure in your undertakings.\nLand\nMine\n", ", the dream points to your need to keep up yourappearances.Lawsuits": "\ndream that you are involved in a lawsuit indicates feelings of guilt and fear of\nbeing caught. You have insecurities and concerns of being judged or criticized\nfor your actions.Lawyer", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  M                              Tweet                                               Page1MtoMascotPage2MasktoMicePage3MickeyMousetoMoodRingPage4MoontoMysteryView              All \"M\" Symbolson One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  M": " see\nthe letter \"M\" in your dream suggests that there is something that you\nare keeping silent about. Perhaps you have been sworn to secrecy. Alternatively,\nthe dream may imply \"Mmmmm\". Your subconscious mind is hungering for\nknowledge or information. As a Roman Numeral, it could\nrepresent the number 1000.M&M's", "to be examined and looked at more closely.Magnolia": " see\nmagnolias in your dream symbolize beauty, grace and elegance.Magnolia\nTree", "ts": " dream\nthat you are practicing martial arts suggest that you need to better focus your\nenergies and direct them on your goals.Martyr", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  N                              Tweet                                               Page1NtoNewsPage2NewspapertoNymphView        All \"N\" Symbols on One PageN": "\nsee the letter \"N\" in your dream implies the end of some habit,\njourney, relationship or condition.Nachos", " finger indicates that you are feeling unappreciated.You are not being recognized for your contribution or hard work. The dream mayalso point to a verbally abusive relationship.Needlepoint*Pleasesee Knittingor Sewing.Negatives": "\nsee picture negatives in your dream represent a relationship or situation that\nis developing. The dream may be a pun on some \"negative\" person or\nforce in your life. Consider also what is being depicted in the negative.", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  P                              Tweet                                               Page1PtoPatientPage2PatiotoPicnicPage3PicturetoPogoStickPage4PoinsettiatoPregnantPage5PregnancyTesttoPythonView              All \"P\" Symbols on One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  ": "\nsee the letter \"P\" in your dream is a pun on \"pee\" or urine.\nYou need to better express your emotions.\n", " the way toward your goals. You are turning intosomeone you dread or someone you don't know anymore.ParkingTicket": "\ndream that you are getting a parking ticket suggests that you are feeling lost\nand not knowing what you want to do with your life. You feel that you are being\njudged and criticized for the path you want to take. The dream may also be\nanalogous to your lack of accomplishments or to the setbacks in your life.Parkour", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  Q                              Tweet                                               Page1QtoQuotisQ": "\nsee the letter Q in your dream is a pun on \"cue\". You are waiting for\na sign to make the next move.Quack", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  R                              Tweet                                               Page1RtoRefusalPage2RegistertoRivalPage3RivertoRyeView              All \"R\" Symbolsin One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL   M    N  O    PQ   R   S    T    UV    W X   Y  Z  R": "\nsee the letter \"R\" in your dream suggests that you are in need of some\n\"R & R\" or some rest and relaxation.Rabbi", "thoughtlessness. Perhaps the dream may be a pun on something that is \"rad-dish\"or coolish.Raffle": "\ndream that you are raffling an item suggests that you need to be more giving and\ncharitable. Alternatively, the dream is telling you to be more aware of the\nrisks involved in leaving your destiny to fate. Raft", ".Reception": "\ndream that you are attending a reception represents togetherness and social\ngatherings. The dream may parallel your social calendar. Alternatively, the\ndream could be a pun that you need to be more \"receptive\" to some new\nidea, situation, relationship or person.\nRecess\n", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  S                              Tweet                                               Page1StoSeasickPage2SeasonstoSizePage3SkateboardtoSpaghettiPage4SpankingtoStorkPage5StormtoSyrupView              All \"S\" Symbols on One Page.DreamDictionaryA  B   C   D   EF    G  H   I  J    KL  M    N  O    PQ  R   S    T    UV    W X   Y  Z  ": "\nsee the letter \"S\" in your dream suggests that there is something that\nneeds your attention. Sabotage", " others. ": "\ndream that you are making someone else a scapegoat indicates that you are not\naccepting responsibilities for your own actions. Scar", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  T                              Tweet                                               Page1TtoTerminalPage2Termiteto": "kenPage\n3", " the score in tennis is denoted as \"love\", then the game oftennis may be a metaphor for a romantic relationship or a courtship.TennisCourt": "\nsee a tennis court in your dream implies that you need to choose a side in some\nchallenge or argument.\nTent\n", "you are leaving behind. It signifies a transitional phase where you areapproaching a new direction in life. Consider if the train or flight wasdelayed, early or on time. The dream may also be a metaphor to symbolize someonewho is \"terminally\" ill or your own fears of death.  Page1TtoTerminalPage2Termiteto": "kenPage\n3", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: teeth dreams                         Tweet                                               \"MyTeeth Are Falling!\"   Dreamsof falling or crumbling teeth are the most common dreams that Dream Moods receives. Thetypical dream scenarios include having your teeth crumble in your hands, fallout one by one with just a light tap, grow crooked or start to rot. Such dreamsare not only horrifying and shocking, but they often leave you with a lastingimage throughout the day. So what does it mean?Fallingteeth relates to vanity:One theory is that dreams about your teeth reflect your anxieties about yourappearance and how others perceive you. Your teeth help to convey an image ofattractiveness and play an important role in the game of flirtation, whether itis flashing those pearly whites, kissing or necking. Thus, such dreams may stemfrom a fear of rejection, feeling unattractive, feeling sexually undesirable orfrom growing older.": " support this notion, a dream research found that women in menopause reported\na higher frequency of dreams about their teeth. So there seems to be a\ncorrelation with getting older and having more teeth dreams.Teeth are an\nimportant feature to your attractiveness and how you are presented to others.\nCaring about how you look is a natural concern.Falling\nteeth relates to communication:When\nyour teeth are missing, you may also have a harder time talking or annunciating\nyour words. Thus your falling teeth dream may be highlighting some communication\nissue. You are not speaking up about something or you feel prevented from doing\nso. Perhaps you are having\ndifficulties expressing yourself or getting your point across.Falling\nteeth relates to embarrassment:\nDreaming that your teeth are falling out or rotting may refer to your\nfears of being embarrassed or making a fool of yourself in some situation. Perhaps you\nfeel unprepared for the task at hand and are afraid of getting ridiculed. \nThese\ndreams are often an over-exaggeration of your worries and anxieties. In most\ncases, all your worrying is for nothing. Sometimes what you imagine is\nfar worse than what is the reality.Falling\nteeth relates to powerlessness:\nTeeth are used to bite, tear, chew and gnaw. In this regard, teeth symbolize\npower. And the loss of teeth in your dream may be from a sense of powerlessness.\nAre you lacking power in some current situation?  You feel\nfrustrated when your voice is not being heard. You may be experiencing feelings\nof inferiority and a lack of self-confidence in some situation or relationship\nin your life. This dream may be an indication that you need to be more assertive\nand believe in the importance of what you have to say. Falling\nteeth relates to health:In\ntraditional dream interpretation books, dreams of missing or losing teeth\npointed to malnutrition or poor diet. This notion may still be applicable to some\ndreamers. The dream could also be a\nsign of poor dental health and that you need to visit a dentist.Falling\nteeth relates to death:We\ndon't usually believe that dreams are an omen or a prediction of some future\nevent. However, we have received numerous emails regarding dreams of  loose, rotten, falling, or missing\nteeth and how it indicates that a\nfamily member or close friend is very sick or near death. We are including it as\na possible meaning of your falling teeth dream and you can decide for yourself.Falling\nteeth relates to money:", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  common              dream: test taking dreams                         Tweet                                               \"IFailed The Test\"Takingan exam in your dream implies that you are being put to the test or beingscrutinized in some area of your waking life. As with most common dream themes,dreams about taking a test have to do with anxiety. In such dreams, you may findthat you cannot answer any of the questions on the test, that the test is insome foreign language or that your pencil keeps breaking during the test.Perhaps time is running out and you cannot complete the exam in the allowedtime. Or perhaps, you arrive late and miss the exam altogether. These factors all result inyou failing the dream test. Takinga test implies being unprepared:": "\ndream that you are taking a test suggests that you feel unprepared for some\nchallenge in your waking life. You may even be harboring some guilt because you did not\nprepare enough for a school exam, meeting, business proposal, or some project.\nPerhaps you have been procrastinating on a task and waited until the last minute\nto cram it all in.Taking\na test implies fear of failing:Sometimes\nyou may be overly anxious about a real life exam, interview, etc. You always\nthink of the worse case scenario. As a result, such anxiety could manifest into\na dream where you fail a test. Most of the time, though, people who have such dreams are unlikely to fail a\ntest in real life.Taking\na test implies lack of confidence:Failing\na test in your dream says a lot about your self-esteem and confidence or the lack of.\nYou tend to sell yourself short and overly worry about not making the grade or\nthat you are not measuring up to other people's\nexpectations of you.  You may even be described as a people pleaser because\nyou don't want to let others down. You\nalways second-guess yourself and fear not being accepted or\nnot being good enough. By\nfailing the dream test, you may be expressing a desire to hold yourself back.\nPerhaps you are not mentally ready to move forward to the next level.Taking\na test implies setting your goals too high:If\nyou set your goals too high, you may also experience a test taking dream. The\ndream may be telling you that you are setting yourself up for failure because\nyou have set unrealistic goals for yourself. Taking\na test implies being scrutinized:Test\ndreams are also an indication that you are being judged. These dreams serve as a\nsignal for you to examine an aspect of yourself that you may have been\nneglecting and need to pay more attention to. Conclusion:In\norder to better understand your test taking dream, identify what aspect of your\nwaking life is giving you a lot of anxiety or making you feel inadequate.\nIt\nis also important to keep in mind that dreams about taking a test are usually never\nabout the content of the test. It is more about the process and about the\nfeelings you experience while taking the test.   other\ncommon dream themes:  chase\ndreams   cheating\ndreams   death\ndreams   falling\ndreams   flying\ndreams   naked\ndreams   snake\ndreams   teeth\ndreams  test\ndreams  \n    \n\n\n\n   \n      Tweet\n\n\n\n\n\n\nGet\n        the Dream Moods app for your smartphone or tablet! \n \n \n\n \n\n\n\n\n\n\n\n\n\n\n\nGet\n        the Dream Moods app for your smartphone or tablet! \n \n \n\n \n\n\n\n\n\n\n\n\n\n\n\n   This\nweb site designed and maintained by Dream\nMoods, Inc.\nEmail the webmaster at dreammoods dot com with questions or comments about this\nweb site.\nView our Disclaimer and Privacy\nPolicy.\nCopyright  2000-2017 Dream\nMoods, Inc. All rights reserved. . Last\nUpdated: February 22, 2017", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  U                              Tweet                                               Page1UtoUtopiaU": "\nsee the letter \"U\" in your dream is a pun on \"you\" and how\nyou act and behave in your waking life. Consider what you are doing and how\nyou are feeling in the dream for additional significance. Alternatively, the\ndream signifies a restart. You need to go back and redo something all over\nagain.  U-Turn", " that have burned out or that youare feeling burnt out and exhausted. An urn also symbolizes the past.U.S.Mailbox*PleaseSee Mailbox.U.S.Visa": "\ndream that you are granted a U.S. visa represents how you feel about the United\nStates and what it stands for to you. For example, if, for you, the U.S. stands\nfor freedom, then being granted a visa from the U.S. may parallel a life\nsituation in which you experience some new found freedom. You may be going\nthrough a period of self-exploration.USB\nDrive", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  V                              Tweet                                               Page1VtoVulvaV": "\nsee the letter V in your dream symbolizes victory, success or peace. As a Roman\nNumeral, it could represent the number 5.Vacant", "or attitudetoward sex. Alternatively, dreaming about your vagina means fertility, life,softness and warmth. ": "\nsee another woman's vagina in your dream signifies your sexual needs or urges.\nIt may also suggest that a new project or idea is coming to fruition.Vagrant", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  W                              Tweet                                               Page1WtoWetaPage2Whac-A-MoletoWrongView        All \"W\" Symbols on One PageW": "\nsee the letter \"W\" in your dream is a reiteration of \"you\".\nYou need to focus on you and only you.Wadding", " ofboth the hearse and the wedding is about an end to something and the beginningof a new phase in your life.": " dream that you\nare late to a wedding or that the wedding started without you means that you\nfeel left behind while everyone around you is doing new things or going in new\ndirection.\n*Please see\nalso Marriage. See\nThe Meaning In Action: \"Black\nWedding\"\nWedding\nCake\n", " a brand new start in a new place.": " see muddy,\nviolent  waves in your dream indicate a fatal error in an important\ndecision.Dreaming\nthat a wave hits your boat and knocks you into the water means that you are\nletting your emotions guide your decisions. Perhaps you are acting too\nirrationally.        \n \nWaving", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  X                              Tweet                                               Page1XtoXylophoneX ": "\nsee an X in your dream signify something that is forbidden. You are being\nprevented to do something. ", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  Y                              Tweet                                               Page1YtoYuleLogY": " see the letter\nY in your dream indicates some decision that you need to make. It may represent\na fork in the road or a path that you need to choose. The letter Y may also be a\npun on \"why\". Perhaps there is something that you need to start\nquestioning. Yacht", "Dictionary:  A  B    C   D   E    F   G   H    I   J   K    L   M    N   O   P   Q    R   S   T   U    V   W   X   Y   Z  Z                              Tweet                                               Page1ZtoZoomorphismZ": " see the letter\n\"Z\" in your dream suggests that you need to get more \"Zzzz's\"\nor rest.Zamboni"}